Revit 2027 API
ComboBoxMemberData Class
This class contains information necessary to construct a ComboBoxMember.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ComboBoxMemberData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ComboBoxMemberData : RibbonItemData
Public Class ComboBoxMemberData
	Inherits RibbonItemData
public ref class ComboBoxMemberData : public RibbonItemData
type ComboBoxMemberData =
    class
        inherit RibbonItemData
    end
The ComboBoxMemberData type exposes the following members.
Constructors
Name | Description
ComboBoxMemberData | Constructs a new instance of ComboBoxMemberData.
Top
Properties
Name | Description
GroupName | Gets or sets a group name for the ComboBoxMember.
Image | The image shown on the ComboBoxMember.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ItemData)
LongDescription |  Long description of the command tooltip
(Inherited from RibbonItemData)
Name |  The internal name of the item.
(Inherited from ItemData)
Text | The user-visible text of the ComboBoxMember.
ToolTip |  The tooltip of item.
(Inherited from ItemData)
ToolTipImage | The image to show as a part of the button extended tooltip
(Inherited from RibbonItemData)
Top
Methods
Name | Description
Dispose
(Inherited from ItemData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetContextualHelp | Gets the contextual help bound with this control.
(Inherited from RibbonItemData)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetContextualHelp | Sets the contextual help bound with this button data.
(Inherited from RibbonItemData)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI Namespace